logs/fio-diskrnd/bridge-operator/000/log004.txt
+ cd /nfs/workloads/slurm
+ mkdir -p tmp
+ cd tmp
+ fio --rw=randwrite --name=kube-fio-write --output-format=normal,terse --bs=256k --size=8G
kube-fio-write: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;91114;355;92067;0;0;0.000000;0.000000;80;102628;2799.424689;4781.609365;1.000000%=95;5.000000%=97;10.000000%=98;20.000000%=99;30.000000%=101;40.000000%=115;50.000000%=144;60.000000%=177;70.000000%=185;80.000000%=8585;90.000000%=9764;95.000000%=11730;99.000000%=16449;99.500000%=17432;99.900000%=38535;99.950000%=41680;99.990000%=51642;0%=0;0%=0;0%=0;83;102632;2803.515088;4781.243258;17920;1659904;100.000000%;91163.119565;138056.265885;0.110790%;4.985554%;8928;3;14;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;19.26%;53.63%;0.01%;0.00%;0.00%;0.39%;0.00%;18.02%;8.49%;0.19%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;608;19305;0;0;12973;307496;320469;92.85%;slaves;989;28559;1;38;24257;320629;345649;99.12%;sda;989;28559;1;38;24257;320629;345649;99.12%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=11864: Wed Nov 22 16:56:18 2023
  write: IOPS=355, BW=89.0MiB/s (93.3MB/s)(8192MiB/92067msec); 0 zone resets
    clat (usec): min=80, max=102628, avg=2799.42, stdev=4781.61
     lat (usec): min=83, max=102632, avg=2803.52, stdev=4781.24
    clat percentiles (usec):
     |  1.00th=[   96],  5.00th=[   98], 10.00th=[   99], 20.00th=[  100],
     | 30.00th=[  102], 40.00th=[  116], 50.00th=[  145], 60.00th=[  178],
     | 70.00th=[  186], 80.00th=[ 8586], 90.00th=[ 9765], 95.00th=[11731],
     | 99.00th=[16450], 99.50th=[17433], 99.90th=[38536], 99.95th=[41681],
     | 99.99th=[51643]
   bw (  KiB/s): min=17920, max=1659904, per=100.00%, avg=91163.12, stdev=138056.27, samples=184
   iops        : min=   70, max= 6484, avg=356.11, stdev=539.28, samples=184
  lat (usec)   : 100=19.26%, 250=53.63%, 500=0.01%
  lat (msec)   : 2=0.39%, 10=18.02%, 20=8.49%, 50=0.19%, 100=0.01%
  lat (msec)   : 250=0.01%
  cpu          : usr=0.11%, sys=4.99%, ctx=8928, majf=3, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=89.0MiB/s (93.3MB/s), 89.0MiB/s-89.0MiB/s (93.3MB/s-93.3MB/s), io=8192MiB (8590MB), run=92067-92067msec

Disk stats (read/write):
    dm-0: ios=608/19305, merge=0/0, ticks=12973/307496, in_queue=320469, util=92.85%, aggrios=989/28559, aggrmerge=1/38, aggrticks=24257/320629, aggrin_queue=345649, aggrutil=99.12%
  sda: ios=989/28559, merge=1/38, ticks=24257/320629, in_queue=345649, util=99.12%
+ fio --rw=randread --name=kube-fio-read --output-format=normal,terse --bs=256k --size=8G
kube-fio-read: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-read;0;0;8388608;198017;773;42363;0;0;0.000000;0.000000;552;122875;1288.993777;4652.431814;1.000000%=774;5.000000%=798;10.000000%=806;20.000000%=815;30.000000%=839;40.000000%=847;50.000000%=856;60.000000%=864;70.000000%=888;80.000000%=929;90.000000%=970;95.000000%=1449;99.000000%=3850;99.500000%=35389;99.900000%=74973;99.950000%=79167;99.990000%=86507;0%=0;0%=0;0%=0;553;122875;1289.343784;4652.430769;3584;297472;99.623962%;197272.380952;129849.887580;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.422549%;10.077428%;32791;0;77;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.30%;91.65%;4.00%;3.12%;0.32%;0.02%;0.25%;0.33%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;32518;2396;0;0;37461;33314;70775;96.38%;slaves;32768;4191;0;12;37920;30408;68372;97.58%;sda;32768;4191;0;12;37920;30408;68372;97.58%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=11964: Wed Nov 22 16:57:01 2023
  read: IOPS=773, BW=193MiB/s (203MB/s)(8192MiB/42363msec)
    clat (usec): min=552, max=122875, avg=1288.99, stdev=4652.43
     lat (usec): min=553, max=122875, avg=1289.34, stdev=4652.43
    clat percentiles (usec):
     |  1.00th=[  775],  5.00th=[  799], 10.00th=[  807], 20.00th=[  816],
     | 30.00th=[  840], 40.00th=[  848], 50.00th=[  857], 60.00th=[  865],
     | 70.00th=[  889], 80.00th=[  930], 90.00th=[  971], 95.00th=[ 1450],
     | 99.00th=[ 3851], 99.50th=[35390], 99.90th=[74974], 99.95th=[79168],
     | 99.99th=[86508]
   bw (  KiB/s): min= 3584, max=297472, per=99.62%, avg=197272.38, stdev=129849.89, samples=84
   iops        : min=   14, max= 1162, avg=770.60, stdev=507.23, samples=84
  lat (usec)   : 750=0.30%, 1000=91.65%
  lat (msec)   : 2=4.00%, 4=3.12%, 10=0.32%, 20=0.02%, 50=0.25%
  lat (msec)   : 100=0.33%, 250=0.01%
  cpu          : usr=0.42%, sys=10.08%, ctx=32791, majf=0, minf=77
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=193MiB/s (203MB/s), 193MiB/s-193MiB/s (203MB/s-203MB/s), io=8192MiB (8590MB), run=42363-42363msec

Disk stats (read/write):
    dm-0: ios=32518/2396, merge=0/0, ticks=37461/33314, in_queue=70775, util=96.38%, aggrios=32768/4191, aggrmerge=0/12, aggrticks=37920/30408, aggrin_queue=68372, aggrutil=97.58%
  sda: ios=32768/4191, merge=0/12, ticks=37920/30408, in_queue=68372, util=97.58%