logs/fio-diskrnd/bridge-operator/000/log008.txt
+ cd /nfs/workloads/slurm
+ mkdir -p tmp
+ cd tmp
+ fio --rw=randwrite --name=kube-fio-write --output-format=normal,terse --bs=256k --size=8G
kube-fio-write: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;95856;374;87512;0;0;0.000000;0.000000;94;114880;2659.282902;4752.298389;1.000000%=95;5.000000%=95;10.000000%=96;20.000000%=97;30.000000%=98;40.000000%=105;50.000000%=127;60.000000%=168;70.000000%=179;80.000000%=8585;90.000000%=10682;95.000000%=11730;99.000000%=16580;99.500000%=17694;99.900000%=24510;99.950000%=26607;99.990000%=56885;0%=0;0%=0;0%=0;96;114883;2663.142568;4751.917311;26112;1692672;99.962971%;95820.505747;141826.196211;0.099416%;5.098788%;8268;3;14;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;33.44%;41.75%;0.01%;0.00%;0.00%;0.29%;0.11%;13.85%;10.29%;0.26%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;32;19812;0;0;1690;286044;287734;91.36%;slaves;68;29621;1;53;3575;305881;310181;99.25%;sda;68;29621;1;53;3575;305881;310181;99.25%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=12823: Wed Nov 22 17:05:34 2023
  write: IOPS=374, BW=93.6MiB/s (98.2MB/s)(8192MiB/87512msec); 0 zone resets
    clat (usec): min=94, max=114880, avg=2659.28, stdev=4752.30
     lat (usec): min=96, max=114883, avg=2663.14, stdev=4751.92
    clat percentiles (usec):
     |  1.00th=[   96],  5.00th=[   96], 10.00th=[   97], 20.00th=[   98],
     | 30.00th=[   99], 40.00th=[  106], 50.00th=[  128], 60.00th=[  169],
     | 70.00th=[  180], 80.00th=[ 8586], 90.00th=[10683], 95.00th=[11731],
     | 99.00th=[16581], 99.50th=[17695], 99.90th=[24511], 99.95th=[26608],
     | 99.99th=[56886]
   bw (  KiB/s): min=26112, max=1692672, per=99.96%, avg=95820.51, stdev=141826.20, samples=174
   iops        : min=  102, max= 6612, avg=374.30, stdev=554.01, samples=174
  lat (usec)   : 100=33.44%, 250=41.75%, 500=0.01%
  lat (msec)   : 2=0.29%, 4=0.11%, 10=13.85%, 20=10.29%, 50=0.26%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.10%, sys=5.10%, ctx=8268, majf=3, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=93.6MiB/s (98.2MB/s), 93.6MiB/s-93.6MiB/s (98.2MB/s-98.2MB/s), io=8192MiB (8590MB), run=87512-87512msec

Disk stats (read/write):
    dm-0: ios=32/19812, merge=0/0, ticks=1690/286044, in_queue=287734, util=91.36%, aggrios=68/29621, aggrmerge=1/53, aggrticks=3575/305881, aggrin_queue=310181, aggrutil=99.25%
  sda: ios=68/29621, merge=1/53, ticks=3575/305881, in_queue=310181, util=99.25%
+ fio --rw=randread --name=kube-fio-read --output-format=normal,terse --bs=256k --size=8G
kube-fio-read: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-read;0;0;8388608;220092;859;38114;0;0;0.000000;0.000000;571;122779;1159.574293;3758.619863;1.000000%=774;5.000000%=798;10.000000%=806;20.000000%=815;30.000000%=839;40.000000%=847;50.000000%=856;60.000000%=864;70.000000%=888;80.000000%=921;90.000000%=962;95.000000%=1302;99.000000%=3751;99.500000%=5734;99.900000%=72876;99.950000%=81264;99.990000%=102236;0%=0;0%=0;0%=0;571;122779;1159.929145;3758.619396;3584;297472;99.957434%;219998.315789;117107.647686;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.438171%;11.242883%;32795;0;287;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.26%;92.23%;3.94%;2.92%;0.21%;0.07%;0.17%;0.19%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;33995;1931;0;0;36724;21874;58598;97.07%;slaves;34648;3292;1;12;41746;20669;62416;98.26%;sda;34648;3292;1;12;41746;20669;62416;98.26%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=12922: Wed Nov 22 17:06:13 2023
  read: IOPS=859, BW=215MiB/s (225MB/s)(8192MiB/38114msec)
    clat (usec): min=571, max=122779, avg=1159.57, stdev=3758.62
     lat (usec): min=571, max=122779, avg=1159.93, stdev=3758.62
    clat percentiles (usec):
     |  1.00th=[   775],  5.00th=[   799], 10.00th=[   807], 20.00th=[   816],
     | 30.00th=[   840], 40.00th=[   848], 50.00th=[   857], 60.00th=[   865],
     | 70.00th=[   889], 80.00th=[   922], 90.00th=[   963], 95.00th=[  1303],
     | 99.00th=[  3752], 99.50th=[  5735], 99.90th=[ 72877], 99.95th=[ 81265],
     | 99.99th=[102237]
   bw (  KiB/s): min= 3584, max=297472, per=99.96%, avg=219998.32, stdev=117107.65, samples=76
   iops        : min=   14, max= 1162, avg=859.39, stdev=457.47, samples=76
  lat (usec)   : 750=0.26%, 1000=92.23%
  lat (msec)   : 2=3.94%, 4=2.92%, 10=0.21%, 20=0.07%, 50=0.17%
  lat (msec)   : 100=0.19%, 250=0.01%
  cpu          : usr=0.44%, sys=11.24%, ctx=32795, majf=0, minf=287
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=215MiB/s (225MB/s), 215MiB/s-215MiB/s (225MB/s-225MB/s), io=8192MiB (8590MB), run=38114-38114msec

Disk stats (read/write):
    dm-0: ios=33995/1931, merge=0/0, ticks=36724/21874, in_queue=58598, util=97.07%, aggrios=34648/3292, aggrmerge=1/12, aggrticks=41746/20669, aggrin_queue=62416, aggrutil=98.26%
  sda: ios=34648/3292, merge=1/12, ticks=41746/20669, in_queue=62416, util=98.26%